#                             დავალება 2) : შევქმნათ input შემდეგ მომხმარებელს შევაყვანინოთ მასში ინფორმაცია და შევქმნათ გამართული წინადადება.




name = input("Please enter your name: ")
surname = input("please enter your surname: ")
age = input("Please enter your age: ")
address = input("Please enter your address: ")
hobby = input("Please enter your favorite hobby: ")
fav_move = input("Please enter your favorite movie: ")

print("my name is" , name , surname , "Im" , age , "years old , i live in" , address , "my favoite hobby is" , hobby , "and my favorite movie is" , fav_move)

#                            ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////// 
#                       //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



#                                    დავალება 4) : შევქმნათ input შემდეგ მომხმარებელს შემოვატანინოთ რაიმე რიცხვი ცვლადებში და გავაკეთოთ
#                                                          მათემატიკური ოპერაციები (ყველა რაც ნასწავლი გვაქვს)




num1 = int(input("Please enter a random number : "))
num2 = int(input("Please enter another random number : "))

print(num1 + num2)
print(num1 // num2)
print(num1 * num2)
print(num1 - num2)
print(num1 / num2)



#                                       დავალება 1) : ავხსნათ რას ნიშნავს input და output როგორ ვიყენებთ მას და ასევე ვისუაბროთ როგორ მუშაობს მოწყობილობებზე

#                                                                        როგორ გამოიყენება input და output პითონში :

#                                      input - ს პროგრამირებაში (პითონში) ვიყენებთ როგორც ინფორმაციის შესატანად რომ მომხმარებელმა შეიტანოს რაღაც ინფორმაცია სისტემაში.
#                                                   მაგალითად : საიტზე რომ შეიყვანოს სახელი მომხმარებელს სჭირდება რომ input - ში შეიყვანოს მისი სახელი.

#                                                                    output - არის შედეგი რომელიც სისტემა გვიბრუნებს.

#                                 ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#                                       ///////////////////////////////////////////////////////////////////////////////////////////////////////////////



#                                                                როგორ გამოიყენება input და output მოწყობილობებზე:

#                                                                                  მაგალითად :    

#                     1) მაგალითი: მიკროფონი არის input ჩემს კომპიუტერში, და output არის ხმა რომელიც მიკროფონიდან გამოდის სხვის კომპიუტერში ან სადმე სისტემაში.
#                     2) მაგალითი: კლავიატურა არის input კომპიუტერში ხოლო output არის შედეგი რომელიც გამოაქვს კლავიატურას ეკრანზე.
             

#                           ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#                           //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


#                                                            დავალება 3) :  გამოვთვალოთ საშუალო არითმეტიკული 

#                  პირველ რიგში შევქმნათ ცვლადები:



number1 = 20
number2 = 40
number3 = 60
number4 = 80
number5 = 100


print((number1 + number2 + number3 + number4 + number5) // 5)
                                                           




#                                                     სოლო ლერნის დავალებაც გაკეთებულია მას, შეგიძლიათ შეამოწმოთ ფოტოებში :)) .