# ჩამოწერეთ პითონის ყველა built-in ფუქნცია რაც ვისწავლეთ, თითოეული აღწერეთ რას აკეთებს და როგორ მუშაობს:

# print() - გამოაქვს შედეგი ტერმინალში, ინფორმაცია გამოიტანოს ტერმინალში / ეკრანზე.
# input() - ინფუთით შეგვიძლია მომხმარებლისაგან ინფორმაცია შემოვიტანოთ და ცვლადში შევინახოთ.
# int() - მონაცემთა ტიპს გადააქცევს ინტეჯერად
# str() - მონაცემთა ტიპს გადააქცევს სტრინგად
# float() - მონაცემთა ტიპს გადააქცევს ათწილადად
# type() - ამ ფუნქციის დახმარებით ჩვენ შეგვიძლია გადავამოწმოთ მონაცემთა ტიპები
# def - def - ით შეგვიძლია შევქმნათ ფუნქცია რომლის გამოყენებაც შეგვიძლია ნებისმიერ დროს.