name = "luka"
age = 14
address = "tbilisi"
weight = 45.67
Height = 175


print(name, age, address, weight, Height)


#                                                           string - ბრჭყალებში მოქცეული სიმბოლოები, მაგალითად: "ლუკა" , "56"
#                               integer - ყველა მთელი რიცხვი მინუს უსასრულობიდან პლიუს უსასრულობამდე, მაგალითად: 12 + 13 = 25 , 12 , 6655,  981 ასშ...
#                                                       float - ყველა ათწილადი, მაგალითად: 6.7 ,  8.99 ,  13.6 და ასშ...  

#                                                    არის ასევე უარყოფითი რიცხვებიც, მაგალითად: -12  ,  -20   , -600 ,  -432
#                                                 უარყოფითი რიცხვები დაიშვება float - შიც, მაგალითად: -6.7  ,  -10.23  ,  -234.11 


#            DECLARATION - ცვლადის შექმნა, ცვლადის სახელი უნდა იყოს მნიშვნელობასთან ახლოს, მაგალითად ჩვენ ვერ შევქმნით ცვლადს როგორიცაა: brand = "გიორგი" ეს არასწორია.
#                                                                                                                         სწორი ფორმა იქნება: Brand = "nike" ეს სწორია 


#                                                                           იმიტომ რომ: 


#                                               არასწორია იმიტომ რომ "გიორგი" არ არის ახლოს brand -  ის მნიშვნელობასთან.
#                                                   სწორია იმიტომ რომ "nike" არის ახლოს brand - ის მნიშვნელობასთან.

#                                  //////////////////////////////////////////////////////////////////////////////////////////////////


#                                                       INITIALIZATION : მნიშვნელობის მინიჭება ცვლადზე.

#                                                                        მაგალითად:

#                                                              age = 19 -> 19 არის ინიცილიზებური 
#                                                                       print (age)
#                                                    print (name) = name -> name - არ არის ინიცილიზირებული    
#                                                                    
#                                                           თუ ის გამოიტანს ტერმნინალში "Error" - ს 

#                                                                ის არ არის ინიცილიზირებული.

#                           /////////////////////////////////////////////////////////////////////////////////////////////////////////////////


#                                                           REINICIALIZATION:  რეინიზიალიზება არის:
#                                                               ცვლადის მნიშვნელობის განახლება
#                                                                        მაგალითად:

#                                                       ვთქვად მე შევქმენი ცვლადი: name = "giorgi"
#                               თუ მე დავპრინტავ ამ ცვლადს, რათქმაუნდა ტერმინალში მივიღებ ცვლადის მნიშვნელობას ანუ "giorgi" - ს.

#                          შემდეგ მე თუ ისევ იგივე ცვლადი შევქმენი და მას დავაწერე ლუკა: name = "luka" ,  "giorgi" - ს, ჩაენაცვლება "luka" 

#                                        იმისდამიუხედავად რომ მე ორი ცვლადი მაქვს ის ტერმინალში მაინც "luka" - ს გამოაჩენს.
#                                                          იმიტომ რომ მე შევცვალე ცვლადის მნიშვნელობა.









