name = "luka"
age = 14
address = "tbilisi"
weight = 45.67
Height = 175


print(name, age, address, weight, Height)


#string - ბრჭყალებში მოქცეული სიმბოლოები, მაგალითად: "ლუკა" , "56"
#integer - ყველა მთელი რიცხვი მინუს უსასრულობიდან პლიუს უსასრულობამდე, მაგალითად: 12 + 13 = 25 , 12 , 6655,  981 ასშ...
#float - ყველა ათწილადი, მაგალითად: 6.7 ,  8.99 ,  13.6 და ასშ...  

#            არის ასევე უარყოფითი რიცხვებიც, მაგალითად: -12  ,  -20   , -600 ,  -432
#         უარყოფითი რიცხვები დაიშვება float - შიც, მაგალითად: -6.7  ,  -10.23  ,  -234.11 