#    დავალება 1) :  ჩამოვწეროთ ყველა მონაცემთა ტიპი.

# string - ბრჭყალებში ჩასმული მოქცეული სიმბოლოები
# integer - ყველა მთელი რიხცხვი , -♾️ - დან  +♾️ - მდე
# float - ყველა ათწილადი

# boolean - ლოგიკური მნიშვნელობა რომელსაც აქვს ორი ტიპის მნიშვნელობა : True და False
#                                                                         კი       არა

# type() - ამოწმებს მონაცემთა ტიპებს.
# Concatenation - კონკატენაცია - (სტრინგების შეერთება)


# input - არის ინფორმაცია რომელიც მოწყობილებაში შედის , შემავალი ინფორმაცია.
# output - არის გამომავალი ინფორმაცია , რომელიც გამოდის მოწყობილებიდან.
# int() - ეს ფუნქცია გვაძლევს საშუალებას რომ მონაცემები ინტეჯერად გადავაქციოთ.


# snake_case - ცვლადის ყველა სახელი გამოიყოფა ქვედა ტირით.




#    დავალება 2) : შევქმნათ ცვლადები და type() - ფუნქციით გავიგოთ რა ტიპის მონაცემია


name = "luka"
age = 15
country = "Georgia"
height = 1.85
is_programmer = True
is_gamer = False


print( type(name) )
print( type(age) )
print( type(country) )
print( type(country) )
print( type(is_programmer) )
print( type(is_gamer) )