# 1) პითონის ფაილში კომენტარის სახით ჩამოწერეთ
# print-ის და return-ს დადებითი და უარყოფითი მხარეები მათი ფუნქციაში გამოყენებისას.

# print() - დადებითი მხარეები:
# 1) შედეგს აჩვენებს ეკრანზე
# 2) Debugging ისთვის კარგი გამოსაყენებელია.
# 3) მარტივია გასატესტად, მხოლოდ შედეგის დანახვა თუ გვსურს.

# print() - უარყოფითი მხარეები:
# 1) შედეგს ვერ ვიყენებთ სხვაგან
# 2) ეკრანი შეიძლება ზედმეტი ტექსტებით აირიოს (გააჩნია როგორ გამოიყენებ)


# return - დადებითი მხარეები:
# 1) აბრუნებს შედეგს პროგრამისთვის (ფუნქციისთვის)
# 2) შედეგი შეგვიძლია შევინახოთ ცვლადში
# 3) სხვა ფუნქციებმაც შეიძლება გამოიყენონ ეს მნიშვნელობა

# return - უარყოფითი მხარეები:
# 1) ეკრანზე ვერაფერს ვხედავ, თუ print არ დავწერ
# 2) return-ის შემდეგ ფუნქცია მთავრდება და ქვემოთ აღარ გრძელდება (აღარ მიდის)